const obj = [
  [
    {
      text            : '나는 업무 중 문제가 생겼을 때 문제를<br>바로 해결하기 전에 그 문제가 발생한 근본<br>원인부터 생각한다.',
      green           : 5,
      yellow          : 3,
      red             : 1
    },
    {
      text            : '나는 문제 해결을 위해 기존에 사용했던 방법을 먼저 적용하는 것이 최선이라고 생각한다.',
      green           : 1,
      yellow          : 3,
      red             : 5
    },
    {
      text            : '나는 업무 중 문제가 생겼을 때 현재 상황을 분석하기보다 다음에 해야 할 업무에 집중한다.',
      green           : 1,
      yellow          : 3,
      red             : 5
    },
    {
      text            : '나는 어떤 업무를 하기 전에 왜 그 업무를 해야 하는지 스스로 파악한 후에 업무에 돌입한다.',
      green           : 5,
      yellow          : 3,
      red             : 1
    },
    {
      text            : '나는 특정한 목표 달성에 실패한 전략은 무조건 폐기하고 완전히 새로운 전략을 수립해야 한다고 생각한다.',
      green           : 1,
      yellow          : 3,
      red             : 5
    }
  ],
  [
    {
      text            : '나는 목표 달성에 실패했을 때 외부 상황이 아닌 나와 우리 팀에서 먼저 실패의 원인을 찾는다.',
      green           : 5,
      yellow          : 3,
      red             : 1
    },
    {
      text            : '나는 업무상 의사결정을 할 때 객관적 사실보다 스스로의 직관에 따르는 편이다.',
      green           : 1,
      yellow          : 3,
      red             : 5
    },
    {
      text            : '나는 어떤 업무를 기획할 때 그 업무가 어떤 성과를 창출해야 하는지 염두에 두어야 한다고 생각한다. ',
      green           : 5,
      yellow          : 3,
      red             : 1
    },
    {
      text            : '객관적인 데이터는 외부에서 수집하는 것이 아니라 사내에서 수집하는 것이 옳다.',
      green           : 1,
      yellow          : 3,
      red             : 5
    },
    {
      text            : '나는 수집한 데이터를 그대로 사용하기보다 의사결정의 근거로 활용할 수 있도록 가공하여 사용하는 편이다.',
      green           : 5,
      yellow          : 3,
      red             : 1
    }
  ],
  [
    {
      text            : '설득력 있는 보고서를 쓰기 위해서는 객관적인 데이터를 기반으로 내용을 작성해야 한다.',
      green           : 5,
      yellow          : 3,
      red             : 1
    },
    {
      text            : '나는 새로운 방식에 대한 아이디어를 내기 위해서 우선 기존 방식에서 아쉬웠던 점이 무엇인지 생각한다.',
      green           : 5,
      yellow          : 3,
      red             : 1
    },
    {
      text            : '나는 기존 방식과 비교했을 때 모든 면에서 새로워야 창의적인 방식이라고 생각한다.',
      green           : 1,
      yellow          : 3,
      red             : 5
    },
    {
      text            : '나는 어떤 문제를 해결해야 할 때 기존에 사용한 방식을 찾고 그 방식을 먼저 적용해 본다.',
      green           : 1,
      yellow          : 3,
      red             : 5
    },
    {
      text            : '나는 어떤 문제를 해결하기 위해 새로운 방식을 활용하기 전에, 그 방식의 장점과 한계를 먼저 파악해야 한다고 생각한다.',
      green           : 5,
      yellow          : 3,
      red             : 1
    }
  ],
  [
    {
      text            : '나는 기존에 실행된 방식을 검토할 때, 그 방식이 실행된 배경을 파악하는 것은 현재가 아닌 과거의 상황을 파악하는 것이므로 불필요하다고 생각한다.',
      green           : 1,
      yellow          : 3,
      red             : 5
    },
    {
      text            : '나는 어떤 업무를 시작할 때 그 업무를 끝내야 하는 데드라인부터 설정한다.',
      green           : 5,
      yellow          : 3,
      red             : 1
    },
    {
      text            : '나는 복잡한 장기 프로젝트를 수행할 때 세부 과업은 업무를 수행하는 과정에서 하나하나 선정해 가는 편이다.',
      green           : 1,
      yellow          : 3,
      red             : 5
    },
    {
      text            : '나는 긴급도와 중요도에 따라 업무를 분류하고 수행한다.',
      green           : 5,
      yellow          : 3,
      red             : 1
    },
    {
      text            : '나는 업무를 수행할 때 최종 데드라인만 구체적으로 설정하고 세부 일정은 구체적으로 설정하지 않는다.',
      green           : 1,
      yellow          : 3,
      red             : 5
    }
  ],
  [
    {
      text            : '나는 데드라인을 설정할 때 성과를 창출할 수 있는 최적의 시기가 언제인지를 고려한다.',
      green           : 5,
      yellow          : 3,
      red             : 1
    },
    {
      text            : '나는 내 업무가 장기적으로 조직 전체에 미칠 영향을 고려하며 일한다.',
      green           : 5,
      yellow          : 3,
      red             : 1
    },
    {
      text            : '나는 내가 맡은 업무와 내 부서의 업무에만 신경쓰고, 타 부서의 업무가 어떻게 진행되고 있는지는 신경쓰지 않는다.',
      green           : 1,
      yellow          : 3,
      red             : 5
    },
    {
      text            : '나는 업무를 하다가 타부서가 전문성을 발휘할 수 있는 부분을 발견해도 일단 내 부서에서 해당 부분을 최대한 해결해 보려고 노력해야 한다고 생각한다.',
      green           : 1,
      yellow          : 3,
      red             : 5
    },
    {
      text            : '나는 어떤 업무를 맡게 되었을 때 회사가 해당 업무를 추진함으로써 달성하고자 하는 목표가 무엇인지 먼저 생각하는 편이다.',
      green           : 5,
      yellow          : 3,
      red             : 1
    }
  ],
  [
    {
      text            : '나는 타부서의 업무라고 할지라도 나의 전문성을 필요로 한다면 주도적으로 지원한다.',
      green           : 5,
      yellow          : 3,
      red             : 1
    },
    {
      text            : '나는 당장의 단기 실적을 내기보다 시간이 더 걸릴지라도 지속적인 장기 실적을 내기 위해 노력하는 편이다.',
      green           : 5,
      yellow          : 3,
      red             : 1
    },
    {
      text            : '나는 혁신적인 무언가를 해내는 위험을 감수하기보다 저(低)리스크의 업무를 수행하는 것이 낫다고 생각한다.',
      green           : 1,
      yellow          : 3,
      red             : 5
    },
    {
      text            : '나는 회사와 생산자 중심의 가치를 창출하려고 노력하는 편이다.',
      green           : 1,
      yellow          : 3,
      red             : 5
    },
    {
      text            : '나는 어떠한 업무를 처리한 후에 실행 과정의 문제점이나 성공 요인 등을 분석한다.',
      green           : 5,
      yellow          : 3,
      red             : 1
    }
  ],
  [
    {
      text            : '나는 어떠한 업무를 처리한 후에는 그 처리 과정에서 발생한 문제점을 보완한 해결책을 찾기보다 바로 다른 업무를 진행하는 것이 낫다고 생각한다.',
      green           : 1,
      yellow          : 3,
      red             : 5
    },
    {
      text            : '나는 상호협력을 위해 조직 구성원들이 가지고 있는 각기 다른 고유한 특성을 충분히 인지하고 있다.',
      green           : 5,
      yellow          : 3,
      red             : 1
    },
    {
      text            : '나는 조직 내의 공정한 관행과 정책이 구성원 간의 차이를 인정하는 것과 별개라고 생각한다.',
      green           : 1,
      yellow          : 3,
      red             : 5
    },
    {
      text            : '나는 모든 구성원들이 스스로 가치 있고 존중 받고 있다고 느낄 수 있도록 서로를 직급이 아닌 특정 업무의 전문가로 대해야 한다고 생각한다.',
      green           : 5,
      yellow          : 3,
      red             : 1
    },
    {
      text            : '나는 조직 구성원들과 협력 관계가 아닌 경쟁 관계라고 인식할 때 업무 성과가 더욱 증대된다고 생각한다.',
      green           : 1,
      yellow          : 3,
      red             : 5
    }
  ],
  [
    {
      text            : '나는 내 부서의 입장과 타 부서의 입장이 부딪칠 때도 서로의 입장을 조율할 수 있는 방법이 있을 거라고 생각한다.',
      green           : 5,
      yellow          : 3,
      red             : 1
    },
    {
      text            : '나는 철저한 계획하에 진행한 업무가 예상치 못한 어려움을 만났다면 어쩔 수 없음을 인정하고 포기한다.',
      green           : 1,
      yellow          : 3,
      red             : 5
    },
    {
      text            : '그동안 숱한 어려움을 이겨낸 조직을 신뢰하기 때문에, 나는 업무를 하다가 어떤 어려움을 만나도 극복할 수 있다고 생각한다.',
      green           : 5,
      yellow          : 3,
      red             : 1
    },
    {
      text            : '나는 업무의 성패는 업무수행자의 재능과 운에 달려 있다고 생각한다.',
      green           : 1,
      yellow          : 3,
      red             : 5
    },
    {
      text            : '나는 업무 중에 만난 장애물을 도전의 기회로 여긴다.',
      green           : 5,
      yellow          : 3,
      red             : 1
    }
  ],
  [
    {
      text            : '나는 내 부서의 입장과 타 부서의 입장이 부딪칠 때도 서로의 입장을 조율할 수 있는 방법이 있을 거라고 생각한다.',
      green           : 5,
      yellow          : 3,
      red             : 1
    },
    {
      text            : '나는 철저한 계획하에 진행한 업무가 예상치 못한 어려움을 만났다면 어쩔 수 없음을 인정하고 포기한다.',
      green           : 1,
      yellow          : 3,
      red             : 5
    },
    {
      text            : '그동안 숱한 어려움을 이겨낸 조직을 신뢰하기 때문에, 나는 업무를 하다가 어떤 어려움을 만나도 극복할 수 있다고 생각한다.',
      green           : 5,
      yellow          : 3,
      red             : 1
    },
    {
      text            : '나는 업무의 성패는 업무수행자의 재능과 운에 달려 있다고 생각한다.',
      green           : 1,
      yellow          : 3,
      red             : 5
    },
    {
      text            : '나는 업무 중에 만난 장애물을 도전의 기회로 여긴다.',
      green           : 5,
      yellow          : 3,
      red             : 1
    }
  ],
  [
    {
      text            : '나는 업무를 수행할 때 부족한 능력이나 필요한 역량이 있다면 동료에게 도움을 요청하거나 회사 자원을 적극 활용하는 편이다.',
      green           : 5,
      yellow          : 3,
      red             : 1
    },
    {
      text            : '나는 고객이 회사의 존립 기반이라고 믿는다.',
      green           : 5,
      yellow          : 3,
      red             : 1
    },
    {
      text            : '고객 만족을 실현하기 위해서는 고객의 의견을 듣는 일보다 전문가의 의견을 듣는 일이 더 우선되어야 한다고 생각한다.',
      green           : 1,
      yellow          : 3,
      red             : 5
    },
    {
      text            : '나는 경쟁사보다 좋은 제품을 만드는 것만으로는 고객 만족을 실현하기 어렵다고 생각한다.',
      green           : 5,
      yellow          : 3,
      red             : 1
    },
    {
      text            : '나는 회사가 사회공헌활동을 통해 지역사회, 정부, 협력업체, 주주 등 다양한 이해관계자들과 함께 상생할 수 있다고 믿는다.',
      green           : 5,
      yellow          : 3,
      red             : 1
    },
    {
      text            : '고객이 회사의 비윤리 행동을 신고할 수 있는 제도를 확립하면 비윤리 행동을 예방할 수 있다는 장점보다 회사의 이미지가 하락할 수 있다는 단점이 크다. ',
      green           : 1,
      yellow          : 3,
      red             : 5
    }
  ]
];

const questions = {
  getData(id) {
    let num = 0;

    if (id) {
      num = id-1;
    }
  
    const data = obj[num];
    return data;
  },
  checkId(id) {
    if (!id) { return false; }

    console.log(obj.length, id);
    if (obj.length >= id) { 
      return true;
    }

    return false;
  }
};

export default questions;